tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "phrase/brewed"
# Search tool like grep, but optimized for programmers
brew "ack"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Process YAML documents from the CLI
brew "yq"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# PhraseApp CLI Tool - API client binary
brew "phrase/brewed/phraseapp"
# Application launcher and productivity software
cask "alfred"
# Test localhost and staging websites
cask "browserstacklocal"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Open-source screen recorder built with web technology
cask "kap"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Open-source code editor
cask "visual-studio-code"
mas "Day One", id: 1055511498
mas "Mela", id: 1568924476
mas "Pandan", id: 1569600264
mas "Session", id: 1521432881
mas "Spark", id: 1176895641
mas "Things", id: 904280696
