tap "gleerups/tap", "git@github.com:gleerups/homebrew-tap.git"
tap "go-swagger/go-swagger"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "phrase/brewed"
tap "shivammathur/php"
# Search tool like grep, but optimized for programmers
brew "ack"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Official Amazon AWS command-line interface
brew "awscli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Postgres C API library
brew "libpq", link: true
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php", link: false
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Text processing system for reStructuredText
brew "docutils"
# Modern replacement for 'ls'
brew "exa"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Linux virtual machines
brew "lima"
# Mac App Store command-line interface
brew "mas"
# Cross-platform application and UI framework
brew "qt@5"
# Game Boy Advance emulator
brew "mgba"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Node version management
brew "n"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12", link: false
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Toolkit to work with swagger for golang
brew "go-swagger/go-swagger/go-swagger"
# General-purpose scripting language
brew "shivammathur/php/php@7.4", link: true
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Test localhost and staging websites
cask "browserstacklocal"
# Web security testing toolkit
cask "burp-suite"
# E-books management software
cask "calibre"
# Nintendo DS emulator
cask "desmume"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Git client focusing on productivity
cask "gitkraken"
# Utility to hide menu bar items
cask "hiddenbar"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Open-source screen recorder built with web technology
cask "kap"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Scan and remove malware, spyware, and viruses
cask "malwarebytes"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Command-line client for Steam
cask "steamcmd"
# Git client
cask "sublime-merge"
# Native GUI tool for relational databases
cask "tableplus"
# Disposable email client
cask "tempbox"
# Open-source code editor
cask "visual-studio-code"
mas "Mela", id: 1568924476
mas "Pandan", id: 1569600264
mas "Session", id: 1521432881
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "Xcode", id: 497799835
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chakrounanas.turbo-console-log"
vscode "ckolkman.vscode-postgres"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jakob101.relativepath"
vscode "meganrogge.template-string-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "tyriar.sort-lines"
vscode "vitest.explorer"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
